In [1]:
%load_ext sql

In [2]:
%sql sqlite:///TMDB.db

In [8]:
%%sql
PRAGMA table_info(movies);

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

In [9]:
%%sql
PRAGMA table_info(languagemap);

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'iso_639_1', 'char(2)', 1, None, 2)]

In [10]:
result = %sql PRAGMA foreign_key_list(languagemap);
foreign_key_count = len(result)
print(f"The 'languagemap' table has {foreign_key_count} foreign keys.")

 * sqlite:///TMDB.db
Done.
The 'languagemap' table has 2 foreign keys.

In [11]:
%%sql
CREATE VIEW Not_Released AS SELECT * FROM movies WHERE release_status <> 'Released'

 * sqlite:///TMDB.db
Done.

[]

In [12]:
%%sql
select * from Not_released

 * sqlite:///TMDB.db
Done.

[(40963, 'Little Big Top', '2006-01-01 00:00:00.000000', 0, None, 'en', 'Little Big Top', 'An aging out of work clown returns to his small hometown, resigned to spend the rest of his days in a drunken stupor. But when his passion for clowning is reawakened by the local amateur circus he finds his smile.', 0.0921, 0.0, 0.0, 'Rumored', None, 10.0, 1),
 (43630, 'The Helix... Loaded', '2005-01-01 00:00:00.000000', 0, None, 'en', 'The Helix... Loaded', ' ', 0.0206, 0.0, 97.0, 'Rumored', None, 4.8, 2),
 (50875, 'Higher Ground', '2011-08-26 00:00:00.000000', 2000000, 'http://www.sonyclassics.com/higherground/', 'en', 'Higher Ground', "A chronicle of one woman's lifelong struggle with her faith.", 1.699101, 841733.0, 109.0, 'Post Production', None, 5.3, 14),
 (57294, 'Crying with Laughter', '2009-06-01 00:00:00.000000', 0, None, 'en', 'Crying with Laughter', 'Powerfully redemptive and darkly comedic revenge thriller set in the vicious world of stand-up comedy, starring Stephen McCole and Malcolm Shields.', 0.108135, 0.0, 93.0, 'Rumored', 'A Bad Trip Down Memory Lane', 7.0, 1),
 (70875, 'The Harvest (La Cosecha)', '2011-07-29 00:00:00.000000', 56000, 'http://www.facebook.com/theharvestfilm', 'en', 'The Harvest (La Cosecha)', 'The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.', 0.010909, 0.0, 80.0, 'Rumored', None, 0.0, 0),
 (84659, 'The Naked Ape', '2006-09-16 00:00:00.000000', 0, None, 'en', 'The Naked Ape', 'The Naked Ape is a coming-of-age film following three teenagers on a road trip across the Pacific Southwest.', 0.077577, 0.0, 110.0, 'Rumored', None, 5.0, 1),
 (295886, 'Brotherly Love', '2015-04-24 00:00:00.000000', 1900000, None, 'en', 'Brotherly Love', 'West Philadelphia basketball star Sergio Taylor deals with the pressures of fame while his brother and sister have their own issues with ambition.', 1.367751, 0.0, 89.0, 'Post Production', None, 6.9, 21),
 (357837, "Dancin' It's On", '2015-10-16 00:00:00.000000', 0, 'https://www.facebook.com/eastsidestorymovie', 'cs', "Dancin' It's On", "This coming of age Dance Film, in the spirit of Dirty Dancing, Karate Kid, and High School Musical - is about a young girl from Beverly Hills, Jennif ... (322 characters truncated) ... preparing for the contest, Jennifer and Ken must overcome scheming dance partners, a meddling father, and their own doubts for their love to prevail.", 0.186234, 0.0, 89.0, 'Post Production', "Dancin' Like You've Never Seen Before", 4.3, 2)]

In [13]:
%%sql
VIEW Not_Released SELECT * FROM movies WHERE release_status <> 'Released'

 * sqlite:///TMDB.db
(sqlite3.OperationalError) near "VIEW": syntax error
[SQL: VIEW Not_Released SELECT * FROM movies WHERE release_status <> 'Released']
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [14]:
%%sql
CREATE VIEW Not_Released SELECT * FROM movies WHERE release_status != 'Released'

 * sqlite:///TMDB.db
(sqlite3.OperationalError) near "SELECT": syntax error
[SQL: CREATE VIEW Not_Released SELECT * FROM movies WHERE release_status != 'Released']
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [16]:
%%sql
SELECT COUNT(*) AS movies_with_changed_titles
FROM movies
WHERE original_title <> title;

 * sqlite:///TMDB.db
Done.

[(261,)]

In [17]:
%%sql
SELECT title, popularity
FROM movies
WHERE release_date > '2000-01-01'
  AND budget > 100000000
ORDER BY popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Interstellar', 724.247784)]

In [30]:
%%sql
SELECT DISTINCT(original_language)
FROM movies
limit 100;

 * sqlite:///TMDB.db
Done.

[('en',),
 ('de',),
 ('es',),
 ('zh',),
 ('ja',),
 ('fr',),
 ('da',),
 ('it',),
 ('sv',),
 ('hi',),
 ('ru',),
 ('pt',),
 ('ko',),
 ('af',),
 ('ro',),
 ('nl',),
 ('ar',),
 ('he',),
 ('th',),
 ('cn',),
 ('tr',),
 ('cs',),
 ('fa',),
 ('no',),
 ('ps',),
 ('vi',),
 ('el',),
 ('hu',),
 ('nb',),
 ('xx',),
 ('id',),
 ('pl',),
 ('is',),
 ('te',),
 ('ta',),
 ('ky',),
 ('sl',)]

In [22]:
%%sql
SELECT COUNT(*)
FROM movies
WHERE original_language <> "en"

 * sqlite:///TMDB.db
Done.

[(298,)]

In [3]:
%%sql
SELECT * 
FROM productioncompanies
limit 20

 * sqlite:///TMDB.db
Done.

[(1, 'Lucasfilm'),
 (2, 'Walt Disney Pictures'),
 (3, 'Pixar Animation Studios'),
 (4, 'Paramount Pictures'),
 (5, 'Columbia Pictures'),
 (6, 'RKO Radio Pictures'),
 (7, 'DreamWorks'),
 (8, 'Fine Line Features'),
 (9, 'Gaumont'),
 (11, 'WingNut Films'),
 (12, 'New Line Cinema'),
 (13, 'Universal Studios'),
 (14, 'Miramax Films'),
 (18, 'Gracie Films'),
 (23, 'Imagine Entertainment'),
 (24, 'Mikona Productions GmbH & Co. KG'),
 (27, 'DreamWorks SKG'),
 (28, 'Newmarket Films'),
 (30, 'Eddie Murphy Productions'),
 (32, 'Buena Vista')]

In [39]:
%%sql
SELECT COUNT (*) PIXAR_MOVIES_COUNT
FROM movies M
JOIN productioncompanymap PCM ON M.movie_id = PCM.movie_id
JOIN productioncompanies PC ON PCM.production_company_id = PC.production_company_id
WHERE production_company_name = "Pixar Animation Studios";

 * sqlite:///TMDB.db
Done.

[(16,)]

In [65]:
%%sql
SELECT COUNT(*) AS romance_comedy_movies_count
FROM movies M
JOIN genremap GM1 ON M.movie_id = GM1.movie_id
JOIN genremap GM2 ON M.movie_id = GM2.movie_id
WHERE GM1.genre_id = '10749'  -- Romance genre_id
  AND GM2.genre_id = '35';    -- Comedy genre_id

 * sqlite:///TMDB.db
Done.

[(484,)]

In [76]:
%%sql
SELECT M.title, M.popularity
FROM movies M
JOIN languagemap LM ON M.movie_id = LM.movie_id
JOIN languages L ON LM.iso_639_1 = L.iso_639_1
JOIN genremap GM  ON M.movie_id = GM.movie_id
WHERE GM.genre_id = '28'
  AND L.iso_639_1 = 'de'
ORDER BY M.popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Captain America: Civil War', 198.372395)]

In [92]:
%%sql
SELECT COUNT(*) Tom_cruise_Ethan_Hunt
FROM casts
WHERE actor_id = 500
AND
characters = "Ethan Hunt";

 * sqlite:///TMDB.db
Done.

[(5,)]

In [95]:
%%sql
SELECT COUNT(*)
FROM oscars
WHERE name = "Cate Blanchett"

 * sqlite:///TMDB.db
Done.

[(7,)]

In [102]:
%%sql
SELECT *
FROM languages
WHERE language_name like "Afrika%" OR language_name like "isi%";

 * sqlite:///TMDB.db
Done.

[('af', 'Afrikaans'), ('zu', 'isiZulu')]

In [111]:
%%sql
SELECT COUNT(*)
FROM movies M
JOIN languagemap LM ON M.movie_id = LM.movie_id
JOIN languages L ON LM.iso_639_1 = L.iso_639_1
WHERE L.language_name = "Afrikaans" OR language_name = "isiZulu"

 * sqlite:///TMDB.db
Done.

[(11,)]

In [125]:
%%sql
SELECT title, popularity
FROM movies
WHERE title IN ('Blood Diamond', "Gangster's Paradise: Jerusalema", "District 9", "Tsotsi")
ORDER BY popularity DESC;

 * sqlite:///TMDB.db
Done.

[('District 9', 63.13678),
 ('Blood Diamond', 52.792678),
 ('Tsotsi', 2.504169),
 ("Gangster's Paradise: Jerusalema", 1.717376)]

In [ ]:
# """UPDATE languages
# SET name = 'Chinese'
# WHERE iso_code = 'zh';"""

In [ ]:
# INSERT INTO genres (genre_id, name)
# VALUES (10, 'Sport');

In [ ]:
# DELETE FROM genremap WHERE genre_id = 35 AND movie_id = 888;

In [128]:
%%sql
SELECT * 
FROM movies 
ORDER BY release_date 
ASC LIMIT 10

 * sqlite:///TMDB.db
Done.

[(380097, 'America Is Still the Place', None, 0, None, 'en', 'America Is Still the Place', '"1971 post civil rights San Francisco seemed like the perfect place for a black Korean War veteran and his family to realize their dream of economic  ... (222 characters truncated) ... pened a door that had never been open to a black man before. This is a story about what happened when he stepped through that door, with both feet!."', 0.0, 0.0, 0.0, 'Released', None, 0.0, 0),
 (3059, 'Intolerance', '1916-09-04 00:00:00.000000', 385907, None, 'en', 'Intolerance', 'The story of a poor young woman, separated by prejudice from her husband and baby, is interwoven with tales of intolerance from throughout history.', 3.232447, 8394751.0, 197.0, 'Released', 'The Cruel Hand of Intolerance', 7.4, 60),
 (3060, 'The Big Parade', '1925-11-05 00:00:00.000000', 245000, None, 'en', 'The Big Parade', "The story of an idle rich boy who joins the US Army's Rainbow Division and is sent to France to fight in World War I, becomes friends with two working class men, experiences the horrors of trench warfare, and finds love with a French girl.", 0.785744, 22000000.0, 151.0, 'Released', None, 7.0, 21),
 (19, 'Metropolis', '1927-01-10 00:00:00.000000', 92620000, None, 'de', 'Metropolis', "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.", 32.351527, 650422.0, 153.0, 'Released', 'There can be no understanding between the hands and the brain unless the heart acts as mediator.', 8.0, 657),
 (905, "Pandora's Box", '1929-01-30 00:00:00.000000', 0, None, 'de', 'Die Bnchse der Pandora', 'The rise and inevitable fall of an amoral but naive young woman whose insouciant eroticism inspires lust and violence in those around her.', 1.824184, 0.0, 109.0, 'Released', None, 7.6, 45),
 (65203, 'The Broadway Melody', '1929-02-08 00:00:00.000000', 379000, None, 'en', 'The Broadway Melody', "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield' ... (195 characters truncated) ... eenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie", 0.968865, 4358000.0, 100.0, 'Released', "The pulsating drama of Broadway's bared heart speaks and sings with a voice to stir your soul!", 5.0, 19),
 (22301, "Hell's Angels", '1930-11-15 00:00:00.000000', 3950000, None, 'en', "Hell's Angels", "Two brothers attending Oxford enlist with the Royal Flying Corps when World War I breaks out. Roy and Monte Rutledge have very different personalitie ... (576 characters truncated) ... t a strategic German munitions facility is a booming success, but with a squadron of fighters bearing down on them afterwards, escape seems unlikely.", 8.484123, 8000000.0, 127.0, 'Released', "Howard Hughes' Thrilling Multi-Million Dollar Air Spectacle", 6.1, 19),
 (22649, 'A Farewell to Arms', '1932-12-08 00:00:00.000000', 4, None, 'en', 'A Farewell to Arms', "British nurse Catherine Barkley (Helen Hayes) and American Lieutenant Frederic Henry (Gary Cooper) fall in love during the First World War in Italy.  ... (105 characters truncated) ... the war rages on. Academy Awards winner for Best Cinematography and for Best Sound, Recording. Nominated for Best Picture and for Best Art Direction.", 1.199451, 25.0, 89.0, 'Released', 'Every woman who has loved will understand', 6.2, 28),
 (3062, '42nd Street', '1933-02-02 00:00:00.000000', 439000, None, 'en', '42nd Street', 'A producer puts on what may be his last Broadway show, and at the last moment a chorus girl has to replace the star.', 1.933366, 2281000.0, 89.0, 'Released', None, 6.1, 37),
 (43595, 'She Done Him Wrong', '1933-02-09 00:00:00.000000', 200000, None, 'en', 'She Done Him Wrong', '"New York singer and nightclub owner Lady Lou has more men friends than you can imagine. Unfortunately one of them is a vicious criminal who\'s escap ... (52 characters truncated) ... ing she hasn\'t exactly been faithful in his absence. Help is at hand in the form of young Captain Cummings a local temperance league leader though."', 0.622752, 2200000.0, 66.0, 'Released', "Mae West gives a 'Hot Time' to the nation!", 5.1, 27)]

In [ ]:
# ALTER TABLE languages ADD language_english_name varchar(50);

In [4]:
%%sql
SELECT TOP(10) * 
FROM movies 
ORDER BY release_date DESC

 * sqlite:///TMDB.db
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT TOP(10) *
FROM movies
ORDER BY release_date DESC]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [5]:
%%sql
SELECT TOP(10) * FROM movies ORDER BY release_date ASC

 * sqlite:///TMDB.db
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT TOP(10) * FROM movies ORDER BY release_date ASC]
(Background on this error at: https://sqlalche.me/e/20/e3q8)